Repository: xshaheen/headless-framework
Catalog: src/Framework.Api/Resources/Messages.*.resx
Languages: ar

# g:concurrency_failure
source: Optimistic concurrency failure, object has been modified. Can not perform two operations at the same time.
ar: فشل التزامن لا يمكن إجراء عمليتين في نفس الوقت.

# g:feature_currently_unavailable
source: This feature currently unavailable.
ar: هذه الميزة غير متوفرة حاليا.

# g:unknown_error
source: An unknown failure has occurred.
ar: حدث خطأ غير معروف.

# g:obsolete_api
source: Obsolete API. This request is not available for this account.
ar: واجهة برمجة تطبيقات قديمة. هذا الطلب غير متوفر لهذا الحساب.

# g:user_not_founded
source: Something went wrong. Try to log in again.
ar: حدث خطأ ما. حاول تسجيل الدخول مرة أخرى.

# g:invalid_recaptcha
source: Recaptcha host, and request host do not match.
ar: التحقق الآلي خاطئ او انتهت المدة من فضلك اعد المحاولة.

# g:not_authorized
source: You are not authenticated to execute request.
ar: أنت لا تملك الصلاحيات لتنفيذ هذا الطلب.

# auth:invalid_token
source: Invalid token.
ar: الرمز غير صالح.

# auth:recovery_code_redemption_failed
source: Recovery code redemption failed.
ar: فشل إيجاد رمز الاسترداد.

# auth:login_already_linked
source: A user with this login already exists. External logins can only be associated with one account.
ar: يوجد بالفعل مستخدم مع تسجيل الدخول هذا.

# auth:invalid_username
source: UserName "{0}" is invalid, can only contain letters or digits.
ar: اسم المستخدم "{0}" غير صالح، يجب أن يحتوي فقط على أحرف أو أرقام بالنمط المحدد.

# auth:invalid_email
source: Email "{0}" is invalid.
ar: البريد الإلكتروني "{0}" غير صالح.

# auth:duplicate_username
source: Username "{0}" is already taken.
ar: اسم المستخدم "{0}" مستخدم بالفعل.

# auth:duplicate_email
source: Email "{0}" is already taken.
ar: البريد الإلكتروني "{0}" مستخدم بالفعل.

# auth:invalid_role
source: Role name "{0}" is invalid.
ar: "{0}" عنوان الصلاحية غير صحيح.

# auth:duplicate_role_name
source: Role name "{0}" is already exist.
ar: اسم الصلاحية "{0}" موجود بالفعل.

# auth:user_already_has_password
source: User already has a password set.
ar: تم تعيين كلمة مرور مسبقا لهذا الحساب بالفعل.

# auth:lockout_not_enabled
source: Lockout is not enabled for this user.
ar: التعطيل المؤقت غير مفعل لهذا المستخدم.

# auth:already_in_role
source: User already in role "{0}".
ar: المستخدم بالفعل يملك الصلاحية "{0}".

# auth:not_in_role
source: User is not in role "{0}".
ar: هذا الحساب لا يملك الصلاحية "{0}".

# auth:password_mismatch
source: Incorrect password.
ar: كلمة سر خاطئة.

# auth:password_too_short
source: Passwords must be at least {0} characters.
ar: يجب أن تتكون كلمة المرور من "{0}" حرف على الأقل.

# auth:password_requires_unique_chars
source: Passwords must use at least {0} different characters.
ar: يجب أن تستخدم كلمات المرور "{0}" حروف مختلفة على الأقل.

# auth:password_requires_non_alphanumeric
source: Passwords must have at least one non alphanumeric character.
ar: يجب أن تحتوي كلمة المرور على حرف واحد غير أبجدي على الأقل.

# auth:password_requires_digit
source: Passwords must have at least one digit ['0'_'9'].
ar: كلمة المرور يجب ان تحتوي علي رقم علي رقم واحد علي الأقل.

# auth:password_requires_lower
source: Passwords must have at least one lowercase ['a'_'z'].
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل ['a' _ 'z'].

# auth:password_requires_upper
source: Passwords must have at least one uppercase ['A'_'Z'].
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل ['A' _ 'Z'].

# auth:email_already_linked
source: Email is already linked to this account.
ar: البريد الإلكتروني مرتبط بالفعل بهذا الحساب.

# auth:login_failed
source: Failed to sign in. Invalid email or password.
ar: فشل تسجيل الدخول. البريد الإلكتروني أو كلمة المرور غير صحيح.

# auth:login_requires_confirmation
source: User cannot sign in without a confirmed account.
ar: لا يمكن للمستخدم تسجيل الدخول بدون حساب تأكيد الحساب.

# auth:login_requires_two_factor
source: Sign in requires two factor authentication.
ar: يتطلب تسجيل الدخول المصادقة الثنائية.

# auth:user_locked_out
source: You tried many times. The account temporarily suspended. Try again later.
ar: لقد حاولت عدة مرات. الحساب معلق مؤقتا. حاول مرة أخرى في وقت لاحق.

# auth:user_requires_alternate_login_or_password
source: Can not remove this external login. There is no other registration method please set a password first.
ar: لا يمكن حذف تسجيل الدخول الخارجي. لا يوجد طريقة تسجيل آخري يرجى تعيين كلمة سر أولاً.

# auth:email_already_confirmed
source: This email already confirmed.
ar: هذا البريد الإلكتروني تم تأكيده من قبل بالفعل.

# auth:login_not_found
source: Login account not associated with any user.
ar: حساب تسجيل الدخول غير مرتبط بأي مستخدم.

# auth:login_token_validation_failed
source: Failed to connect to the authentication provider.
ar: فشل في الاتصال بمزود المصادقة.

# auth:invalid_login_token
source: Invalid login token.
ar: رمز تسجيل الدخول غير صالح.

# auth:remove_password_requires_alternate_login
source: In order to remove the password, the account must have an alternative to login.
ar: لكي تقوم بحذف كلمة المرور يجب ان يملك الحساب بديل لتسجيل الدخول.

# auth:invalid_login_identifier
source: Invalid login identifier. To login, you must use your phone number, national ID, or your email address.
ar: لم يتم التعرف علي معرف تسجيل الدخول. لتسجيل الدخول يجب عليك استخدام رقم الموبايل الخاص بحسابك أو الرقم القومي أو البريد الإلكتروني.

# auth:expired_token
source: The token has expired.
ar: انتهت صلاحية الرمز.

# user:duplicated_national_id
source: Duplicated national ID.
ar: الرقم القومي مكرر.

# user:duplicated_phone_number
source: Duplicated phone number.
ar: رقم هاتف مكرر.

# user:request_verify_email_attempts_exceeded
source: You have exceeded the maximum number of attempts `{0}` to verify your email address. Please try again after {1}.
ar: لقد تجاوزت الحد الأقصى لعدد المحاولات `{0}` للتحقق من عنوان بريدك الإلكتروني. يرجى المحاولة مرة أخرى بعد {1}.

# user:request_forget_password_cooldown
source: You can only request forget password once every {0}. Please wait {1} before trying again.
ar: يمكنك طلب نسيان كلمة المرور مرة واحدة فقط كل {0}. الرجاء الانتظار {1} قبل المحاولة مرة أخرى.

# user:request_forget_password_attempts_exceeded
source: You have exceeded the maximum number of attempts to request forget password. Please try again after {0}.
ar: لقد تجاوزت الحد الأقصى لعدد المحاولات لطلب نسيان كلمة المرور. يرجى المحاولة مرة أخرى بعد {0}.

# user:already_unlocked
source: User is not locked out.
ar: تسجيل الدخول لهذا الحساب غير مؤمن بالفعل.

# user:request_verify_email_cooldown
source: You can only request to verify your email address once every {0}. Please wait {1} before trying again.
ar: لا يمكنك طلب التحقق من عنوان بريدك الإلكتروني إلا مرة واحدة كل {0}. الرجاء الانتظار {1} قبل المحاولة مرة أخرى.

# user:phone_number_already_linked_to_other_user
source: Phone number {0} is already linked to another user.
ar: رقم الهاتف {0} مرتبط بالفعل بمستخدم آخر.

source: User already unblocked.
ar: تم إلغاء حظر المستخدم بالفعل.

source: User already blocked.
ar: تم حظر المستخدم بالفعل.

# user:email_already_linked_to_other_user
source: Email {0} is already linked to another user.
ar: البريد الإلكتروني {0} مرتبط بالفعل بمستخدم آخر.

# g:duplicated_request
source: Duplicated request detected.
ar: طلب مكرر.
